In [10]:
import pandas as pd
import numpy as np
dF=pd.read_excel("kitap1.xlsx")
dF

  Unnamed: 0  Maas   Yas  Departman
0      Ahmet    50  40.0    Yazılım
1     Mehmet    60  50.0      Satış
2      Burak   100  21.0        NaN
3       Veli    42   NaN  Pazarlama
4   Alpaslan    71  32.0      Hukuk

In [11]:
dolu = dF.dropna()
dolu

  Unnamed: 0  Maas   Yas Departman
0      Ahmet    50  40.0   Yazılım
1     Mehmet    60  50.0     Satış
4   Alpaslan    71  32.0     Hukuk

## Excele Kaydetmek

In [13]:
dolu.to_excel("yeni kitap.xlsx")